from random import randint

# chat id:
# 1- test bota
# 2 - taverna
# 3 - Беседа у Батоса с Гелей и Матвеем
# 4 - Предположительно - беседа Антона

# lesson = {
#     '1 пара': 1,
#     "2 пара": 2,
#     "3 пара": 3,
#     "4 пара": 4,
#     "5 пара": 5,
#     "6 пара": 6,
#     "Занятия не проводятся": None
# }
#
# group = [
#     None,
#     {
#         'Неделя над чертой':
#             {
#                 'Понедельник': "1- Английский язык, аудитория 7-426, преподаватель -- Репина Т. Ю. \n"
#                                "2- Английский язык, аудитория 7-426, преподаватель -- Репина Т. Ю. \n"
#                                "3- Математическая логика, аудитория 3-215, лекция, преподаватель -- Исенбаева Е. Н. \n"
#                                "4- Электротехника, аудитория 1-105, лекция, преподователь -- Штин А. А. \n"
#                                "5- ООП, аудитория 3-602, практика, преподователь -- Исупов Н. С. \n"
#                                 "6- Электротехника, аудитория 1-312, практика, преподователь -- Штин А. А. \n"
#                 ,
#                 'Вторник': [],
#                 'Среда': [],
#                 'Четверг': [],
#                 'Пятница': [],
#                 'Суббота': [],
#                 'Воскресенье': []
#             },
#         'Неделя под чертой':
#             {
#                 'Понедельник': [],
#                 'Вторник': [],
#                 'Среда': [],
#                 'Четверг': [],
#                 'Пятница': [],
#                 'Суббота': [],
#                 'Воскресенье': []
#             }
#     }
# ]

schedule_for_other_group = {
    1: 'photo-198707501_457239017',
    2: 'photo-198707501_457239017',
    3: 'photo-198707501_457239017',
    4: "photo-198707501_457239029",
    5: None
}


def schedule(chat_id):
    try:
        return schedule_for_other_group[chat_id]
    except BaseException:
        print('траблы с расписанием')
        return None


print(schedule(2))
